robert-hh/micropython/ports/mimxrt/machine_sdcard.c
static cid_t sdcard_cmd_all_send_cid(USDHC_Type *base) {
    status_t status;
    cid_t cid;
    usdhc_command_t command = {
        .index = SDCARD_CMD_ALL_SEND_CID,
        .argument = 0UL,
        .type = kCARD_CommandTypeNormal,
        .responseType = kCARD_ResponseTypeR2,
    };
    usdhc_transfer_t transfer = {
        .data = NULL,
        .command = &command,
    };

    mp_printf(&mp_plat_print, "CMD %d started\n", command.index);
    status = USDHC_TransferBlocking(base, NULL, &transfer);
    sdcard_check_status(status, SDCARD_CMD_ALL_SEND_CID);
    // --
    cid.mdt = (uint16_t)((command.response[0] & 0xFFF00U) >> 8U);
    cid.psn = (uint32_t)(((command.response[1] & 0xFFFFFFU) << 8U) | ((command.response[0] & 0xFF000000U) >> 24U));
    cid.prv = (uint8_t)((command.response[1] & 0xFF000000U) >> 24U);
    cid.pnm[0] = (char)(command.response[2] & 0xFFU);
    cid.pnm[1] = (char)((command.response[2] & 0xFF00U) >> 8U);
    cid.pnm[2] = (char)((command.response[2] & 0xFF0000U) >> 16U);
    cid.pnm[3] = (char)((command.response[2] & 0xFF000000U) >> 24U);
    cid.pnm[4] = (char)(command.response[3] & 0xFFU);
    cid.pnm[5] = '\0';
    cid.oid = (uint16_t)((command.response[3] & 0xFFFF00U) >> 8U);
    cid.mid = (uint8_t)((command.response[3] & 0xFF000000U) >> 24U);
    // --
    return cid;
}

static cid_t sdcard_cmd_send_cid(USDHC_Type *base, uint32_t rca) {
    status_t status;
    cid_t cid;
    usdhc_command_t command = {
        .index = SDCARD_CMD_SEND_CID,
        .argument = (rca << 16),
        .type = kCARD_CommandTypeNormal,
        .responseType = kCARD_ResponseTypeR2,
    };
    usdhc_transfer_t transfer = {
        .data = NULL,
        .command = &command,
    };

    mp_printf(&mp_plat_print, "CMD %d started\n", command.index);
    status = USDHC_TransferBlocking(base, NULL, &transfer);
    sdcard_check_status(status, SDCARD_CMD_SEND_CID);
    // --
    cid.mdt = (uint16_t)((command.response[0] & 0xFFF00U) >> 8U);
    cid.psn = (uint32_t)(((command.response[1] & 0xFFFFFFU) << 8U) | ((command.response[0] & 0xFF000000U) >> 24U));
    cid.prv = (uint8_t)((command.response[1] & 0xFF000000U) >> 24U);
    cid.pnm[0] = (char)(command.response[2] & 0xFFU);
    cid.pnm[1] = (char)((command.response[2] & 0xFF00U) >> 8U);
    cid.pnm[2] = (char)((command.response[2] & 0xFF0000U) >> 16U);
    cid.pnm[3] = (char)((command.response[2] & 0xFF000000U) >> 24U);
    cid.pnm[4] = (char)(command.response[3] & 0xFFU);
    cid.pnm[5] = '\0';
    cid.oid = (uint16_t)((command.response[3] & 0xFFFF00U) >> 8U);
    cid.mid = (uint8_t)((command.response[3] & 0xFF000000U) >> 24U);
    // --
    return cid;
}

static uint32_t sdcard_cmd_set_rel_add(USDHC_Type *base) {
    status_t status;
    usdhc_command_t command = {
        .index = SDCARD_CMD_SEND_REL_ADDR,
        .argument = 0UL,
        .type = kCARD_CommandTypeNormal,
        .responseType = kCARD_ResponseTypeR6,
    };
    usdhc_transfer_t transfer = {
        .data = NULL,
        .command = &command,
    };

    mp_printf(&mp_plat_print, "CMD %d started\n", command.index);
    status = USDHC_TransferBlocking(base, NULL, &transfer);
    sdcard_check_status(status, SDCARD_CMD_SEND_REL_ADDR);
    return 0xFFFFFFFF & (command.response[0] >> 16);
}

static csd_t sdcard_cmd_send_csd(USDHC_Type *base, uint32_t rca) {
    status_t status;
    csd_t csd;
    usdhc_command_t command = {
        .index = SDCARD_CMD_SEND_CSD,
        .argument = (rca << 16),
        .type = kCARD_CommandTypeNormal,
        .responseType = kCARD_ResponseTypeR2,
    };
    usdhc_transfer_t transfer = {
        .data = NULL,
        .command = &command,
    };

    mp_printf(&mp_plat_print, "CMD %d started\n", command.index);
    status = USDHC_TransferBlocking(base, NULL, &transfer);
    sdcard_check_status(status, SDCARD_CMD_SEND_CSD);
    // --
    csd.csd_structure = 0x3 & (command.response[3] >> 30);
    csd.taac = 0xFF & (command.response[3] >> 16);
    csd.nsac = 0xFF & (command.response[3] >> 8);
    csd.tran_speed = 0xFF & (command.response[3]);

    csd.ccc = 0xFFF & (command.response[2] >> 20);
    csd.read_bl_len = 0xF & (command.response[2] >> 16);
    csd.read_bl_partial = 0x1 & (command.response[2] >> 15);
    csd.write_blk_misalign = 0x1 & (command.response[2] >> 14);
    csd.read_blk_misalign = 0x1 & (command.response[2] >> 13);
    csd.dsr_imp = 0x1 & (command.response[2] >> 12);
    csd.c_size = (0x3FF & (command.response[2] << 2)) |
        (0x3 & (command.response[1] >> 30));

    csd.vdd_r_curr_min = 0x7 & (command.response[1] >> 27);
    csd.vdd_r_curr_max = 0x7 & (command.response[1] >> 24);
    csd.vdd_w_curr_min = 0x7 & (command.response[1] >> 21);
    csd.vdd_w_curr_max = 0x7 & (command.response[1] >> 18);
    csd.c_size_mult = 0x7 & (command.response[1] >> 15);
    csd.erase_blk_en = 0x1 & (command.response[1] >> 14);
    csd.sector_size = 0x7F & (command.response[1] >> 7);
    csd.wp_grp_size = 0x7F & (command.response[1]);

    csd.wr_grp_enable = 0x1 & (command.response[0] >> 31);
    csd.r2w_factor = 0x7 & (command.response[0] >> 26);
    csd.write_bl_len = 0xF & (command.response[0] >> 22);
    csd.write_bl_partial = 0x1 & (command.response[0] >> 21);
    csd.file_format_grp = 0x1 & (command.response[0] >> 15);
    csd.copy = 0x1 & (command.response[0] >> 14);
    csd.perm_write_protecct = 0x1 & (command.response[0] >> 13);
    csd.temp_write_protect = 0x1 & (command.response[0] >> 12);
    csd.file_format = 0x3 & (command.response[0] >> 10);
    // --
    return csd;
}

static uint32_t sdcard_cmd_select_card(USDHC_Type *base, uint32_t rca) {
    status_t status;
    usdhc_command_t command = {
        .index = SDCARD_CMD_SELECT_CARD,
        .argument = (rca << 16),
        .type = kCARD_CommandTypeNormal,
        .responseType = kCARD_ResponseTypeR1b,
        .responseErrorFlags = SDMMC_R1_ALL_ERROR_FLAG,
    };
    usdhc_transfer_t transfer = {
        .data = NULL,
        .command = &command,
    };
    mp_printf(&mp_plat_print, "CMD %d started\n", command.index);
    status = USDHC_TransferBlocking(base, NULL, &transfer);
    sdcard_check_status(status, SDCARD_CMD_SELECT_CARD);
    sdcard_card_status(SDMMC_R1_CURRENT_STATE(command.response[0]));
    return command.response[0];
}

static uint32_t sdcard_cmd_stop_transmission(USDHC_Type *base) {
    status_t status;
    usdhc_command_t command = {
        .index = SDCARD_CMD_STOP_TRANSMISSION,
        .argument = 0UL,
        .type = kCARD_CommandTypeNormal,
        .responseType = kCARD_ResponseTypeR1b,
        .responseErrorFlags = SDMMC_R1_ALL_ERROR_FLAG,
    };
    usdhc_transfer_t transfer = {
        .data = NULL,
        .command = &command,
    };
    mp_printf(&mp_plat_print, "CMD %d started\n", command.index);
    status = USDHC_TransferBlocking(base, NULL, &transfer);
    sdcard_check_status(status, SDCARD_CMD_STOP_TRANSMISSION);
    sdcard_card_status(SDMMC_R1_CURRENT_STATE(command.response[0]));
    return command.response[0];
}

static uint32_t sdcard_cmd_set_blocklen(USDHC_Type *base, uint32_t block_size) {
    status_t status;
    usdhc_command_t command = {
        .index = SDCARD_CMD_SET_BLOCKLENGTH,
        .argument = block_size,
        .type = kCARD_CommandTypeNormal,
        .responseType = kCARD_ResponseTypeR1,
        .responseErrorFlags = SDMMC_R1_ALL_ERROR_FLAG,
    };
    usdhc_transfer_t transfer = {
        .data = NULL,
        .command = &command,
    };
    mp_printf(&mp_plat_print, "CMD %d started\n", command.index);
    status = USDHC_TransferBlocking(base, NULL, &transfer);
    sdcard_check_status(status, SDCARD_CMD_SET_BLOCKLENGTH);
    sdcard_card_status(SDMMC_R1_CURRENT_STATE(command.response[0]));
    return command.response[0];
}

